# Bienvenido al Notebook de Transformaciones
Acá vas a ver todas las transformaciones básicas para poner a funcionar el dataset que en un principio estaba casi inutilizable o muy difícil de acceder, lo que hago acá es disponibilizar los datos

In [1]:
import pandas as pd #Importo las librerías que voy a utilizar, solo pandas...

In [2]:
df_a_transformar = pd.read_csv('./datasets/movies_dataset.csv') #Accedo al csv entre mis archivos con la ruta relativa
df_a_transformar.head(2)

C:\Users\yesen\AppData\Local\Temp\ipykernel_8448\4105753216.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  df_a_transformar = pd.read_csv('./datasets/movies_dataset.csv') #Accedo al csv entre mis archivos con la ruta relativa

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0

### Accedo a las columnas con diccionarios anidados
Primero quiero disponibilizar los datos que serían los más difíciles de acceder en el caso de que se mantengan como están.

In [12]:
df_btc = df_a_transformar['belongs_to_collection'] #Comenzamos con una de las columnas que tiene los diccionarios("belngs_to_collection")
df_btc.head(5)

0    {'id': 10194, 'name': 'Toy Story Collection', ...
1                                                  NaN
2    {'id': 119050, 'name': 'Grumpy Old Men Collect...
3                                                  NaN
4    {'id': 96871, 'name': 'Father of the Bride Col...
Name: belongs_to_collection, dtype: object

In [13]:
df_btc = df_btc.dropna()#Borro nulos

In [14]:
df_btc.head()

0     {'id': 10194, 'name': 'Toy Story Collection', ...
2     {'id': 119050, 'name': 'Grumpy Old Men Collect...
4     {'id': 96871, 'name': 'Father of the Bride Col...
9     {'id': 645, 'name': 'James Bond Collection', '...
12    {'id': 117693, 'name': 'Balto Collection', 'po...
Name: belongs_to_collection, dtype: object

In [15]:
dict_list = df_btc.apply(eval).tolist() #Creo una lista con el dataframe para trabajarlo con python puro, dado que es mas sencillo para mi

In [20]:
in_list=[] #Creo una lista para los indices de los elementos que no sean diccionarios
for i in range(len(dict_list)):
    if not type(dict_list[i]) == dict: #Verifico que los elementos sean diccionarios y en el caso de que no lo sean se agregaran a una lista para posteriormente ser eliminados
        print(dict_list[i])
        in_list.append(i)

print(in_list)

2.185485
[3809]

In [21]:
for i in range(len(in_list)): #Elimino los elementos que no sean diccionarios
    del dict_list[in_list[i]]

In [22]:
df_btc = pd.DataFrame(dict_list, columns=['id', 'name', 'poster_path', 'backdrop_path']) #Creo el dataframe con los datos de los diccionarios tomando cada key como columna

In [23]:
df_btc.head()#Observamos

,id,name,poster_path,backdrop_path
0,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
1,119050,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg
2,96871,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg
3,645,James Bond Collection,/HORpg5CSkmeQlAolx3bKMrKgfi.jpg,/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg
4,117693,Balto Collection,/w0ZgH6Lgxt2bQYnf1ss74UvYftm.jpg,/9VM5LiJV0bGb1st1KyHA3cVnO2G.jpg

In [24]:
lista_lis = df_a_transformar['genres'] #Seguimos con la columna "genres"
df_genres =  lista_lis

In [25]:
df_genres.head()

0    [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1    [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
2    [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
3    [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
4                       [{'id': 35, 'name': 'Comedy'}]
Name: genres, dtype: object

In [26]:
'''
Para ésta columna fué sencillo solo creé una lista auxiliar(lista_aux) en la cual primero guardé el string del registro en el indice[i] y 
después usé la función eval() para convertirlo en lista.
Dado que era habían diccionaros anidados lo que hice fué acceder a cada una en un segundo bucle(for) y añadirlos a una nueva lista para
finalmente convertir todo en un dataframe(df_genres)
'''
dimentions = df_genres.shape 
df = []
for i in range(dimentions[0]-1):
    lista_aux = str(df_genres.loc[i]) 
    lista_aux = eval(lista_aux)

    for dicc in lista_aux:
        df.append(dicc)

df_genres = pd.DataFrame(df)

In [27]:
df_genres.columns=['id', 'genre']

In [28]:
df_genres

          id      genre
0         16  Animation
1         35     Comedy
2      10751     Family
3         12  Adventure
4         14    Fantasy
...      ...        ...
91101  10751     Family
91102     18      Drama
91103     28     Action
91104     18      Drama
91105     53   Thriller

[91106 rows x 2 columns]

In [29]:
df_a_transformar[['id','production_companies']].head(5)

      id                               production_companies
0    862     [{'name': 'Pixar Animation Studios', 'id': 3}]
1   8844  [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2  15602  [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3  31357  [{'name': 'Twentieth Century Fox Film Corporat...
4  11862  [{'name': 'Sandollar Productions', 'id': 5842}...

In [30]:
df_production_companies = df_a_transformar['production_companies']#Continuamos con la columna "production_companies"
df_production_companies

0           [{'name': 'Pixar Animation Studios', 'id': 3}]
1        [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2        [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3        [{'name': 'Twentieth Century Fox Film Corporat...
4        [{'name': 'Sandollar Productions', 'id': 5842}...
                               ...
45461                                                   []
45462               [{'name': 'Sine Olivia', 'id': 19653}]
45463    [{'name': 'American World Pictures', 'id': 6165}]
45464                 [{'name': 'Yermoliev', 'id': 88753}]
45465                                                   []
Name: production_companies, Length: 45466, dtype: object

In [31]:
df_production_companies = df_production_companies.dropna().reset_index(drop=True) #Borro los nulos y reseteo los indices para evitar errores en la iteración

In [32]:
df_production_companies

0           [{'name': 'Pixar Animation Studios', 'id': 3}]
1        [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2        [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3        [{'name': 'Twentieth Century Fox Film Corporat...
4        [{'name': 'Sandollar Productions', 'id': 5842}...
                               ...
45458                                                   []
45459               [{'name': 'Sine Olivia', 'id': 19653}]
45460    [{'name': 'American World Pictures', 'id': 6165}]
45461                 [{'name': 'Yermoliev', 'id': 88753}]
45462                                                   []
Name: production_companies, Length: 45463, dtype: object

In [33]:
mask = df_production_companies == "[]"
df_production_companies = df_production_companies[~mask].reset_index(drop = True) #Borro listas vacías que no me aportan nada y vuelvo a resetear lo indices

In [34]:
df_production_companies

0           [{'name': 'Pixar Animation Studios', 'id': 3}]
1        [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2        [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3        [{'name': 'Twentieth Century Fox Film Corporat...
4        [{'name': 'Sandollar Productions', 'id': 5842}...
                               ...
33583      [{'name': 'Concorde-New Horizons', 'id': 4688}]
33584    [{'name': 'Westdeutscher Rundfunk (WDR)', 'id'...
33585               [{'name': 'Sine Olivia', 'id': 19653}]
33586    [{'name': 'American World Pictures', 'id': 6165}]
33587                 [{'name': 'Yermoliev', 'id': 88753}]
Name: production_companies, Length: 33588, dtype: object

In [35]:
dimenciones = df_production_companies.shape 
lista_de = []
#Itero cada registro y los agrego en una lista(lista_de) para trabajarlo mejor
for i in range(dimenciones[0]-1): 
    s = df_production_companies.loc[i]
    lista_de.append(eval(s))

In [36]:
i = -1
lista_ind = []
#Me daba un error de tipo(bool) así que borro todos los registros que sean booleanos(porque no eran muchos) 
for lista in lista_de: 
    i+=1
    if type(lista) == bool:
        lista_ind.append(i)
        lista_de.pop(i)
lista_ind

[16340, 23302, 27253]

In [37]:
for_df = []
#Ahora si lo transformo en DataFrame 
for lista in lista_de:
    for dicc in lista:
        for_df.append(dicc)

df_production_companies = pd.DataFrame(for_df)

In [38]:
df_production_companies.columns=['companies', 'id']

In [39]:
df_production_companies.head()

                   companies     id
0    Pixar Animation Studios      3
1           TriStar Pictures    559
2               Teitler Film   2550
3  Interscope Communications  10201
4               Warner Bros.   6194

In [40]:
df_production_countries = df_a_transformar['production_countries']#Continuamos con la siguiente columna que se llama "production_companies"
df_production_countries

0        [{'iso_3166_1': 'US', 'name': 'United States o...
1        [{'iso_3166_1': 'US', 'name': 'United States o...
2        [{'iso_3166_1': 'US', 'name': 'United States o...
3        [{'iso_3166_1': 'US', 'name': 'United States o...
4        [{'iso_3166_1': 'US', 'name': 'United States o...
                               ...
45461               [{'iso_3166_1': 'IR', 'name': 'Iran'}]
45462        [{'iso_3166_1': 'PH', 'name': 'Philippines'}]
45463    [{'iso_3166_1': 'US', 'name': 'United States o...
45464             [{'iso_3166_1': 'RU', 'name': 'Russia'}]
45465     [{'iso_3166_1': 'GB', 'name': 'United Kingdom'}]
Name: production_countries, Length: 45466, dtype: object

In [41]:
df_production_countries = df_production_countries.dropna().reset_index(drop=True) #Borro nulos y reseteo indices
df_production_countries

0        [{'iso_3166_1': 'US', 'name': 'United States o...
1        [{'iso_3166_1': 'US', 'name': 'United States o...
2        [{'iso_3166_1': 'US', 'name': 'United States o...
3        [{'iso_3166_1': 'US', 'name': 'United States o...
4        [{'iso_3166_1': 'US', 'name': 'United States o...
                               ...
45458               [{'iso_3166_1': 'IR', 'name': 'Iran'}]
45459        [{'iso_3166_1': 'PH', 'name': 'Philippines'}]
45460    [{'iso_3166_1': 'US', 'name': 'United States o...
45461             [{'iso_3166_1': 'RU', 'name': 'Russia'}]
45462     [{'iso_3166_1': 'GB', 'name': 'United Kingdom'}]
Name: production_countries, Length: 45463, dtype: object

In [43]:
dimenciones = df_production_countries.shape
lista_de_=[]
#Creo una lista con cada uno de los registros
for i in range(dimenciones[0]-1):
    s = str(df_production_countries.loc[i])
    lista_de_.append(eval(s))#Les recuerdo que la función eval() lo que hace es detectar si un string tiene formato de una expreción de un tipo de dato de python y la transforma en ese tipo

In [44]:
#Otra vez había error de tipo, esta vez es por datos del tipo flotante, como no eran muchos(3) decidí borrarlos 
for item in lista_de_:
    if type(item) == float:
        lista_de_.remove(item)

In [45]:
for_df = []
#Hago la devida transformación a dataframe
for lista in lista_de_:
    for dicc in lista:
        for_df.append(dicc)

df_production_countries = pd.DataFrame(for_df)

In [46]:
df_production_countries.columns=['countries', 'full_country']

In [47]:
df_production_countries

      countries              full_country
0            US  United States of America
1            US  United States of America
2            US  United States of America
3            US  United States of America
4            US  United States of America
...         ...                       ...
49417        US  United States of America
49418        IR                      Iran
49419        PH               Philippines
49420        US  United States of America
49421        RU                    Russia

[49422 rows x 2 columns]

In [48]:
df_s_l = df_a_transformar['spoken_languages']#la ultima columna con listas y diccionarios anidados "spoken_languages"
df_s_l

0                 [{'iso_639_1': 'en', 'name': 'English'}]
1        [{'iso_639_1': 'en', 'name': 'English'}, {'iso...
2                 [{'iso_639_1': 'en', 'name': 'English'}]
3                 [{'iso_639_1': 'en', 'name': 'English'}]
4                 [{'iso_639_1': 'en', 'name': 'English'}]
                               ...
45461               [{'iso_639_1': 'fa', 'name': 'فارسی'}]
45462                    [{'iso_639_1': 'tl', 'name': ''}]
45463             [{'iso_639_1': 'en', 'name': 'English'}]
45464                                                   []
45465             [{'iso_639_1': 'en', 'name': 'English'}]
Name: spoken_languages, Length: 45466, dtype: object

In [49]:
df_s_l = df_s_l.dropna().reset_index(drop=True) #Borro nulos y reseteo inidices
df_s_l

0                 [{'iso_639_1': 'en', 'name': 'English'}]
1        [{'iso_639_1': 'en', 'name': 'English'}, {'iso...
2                 [{'iso_639_1': 'en', 'name': 'English'}]
3                 [{'iso_639_1': 'en', 'name': 'English'}]
4                 [{'iso_639_1': 'en', 'name': 'English'}]
                               ...
45455               [{'iso_639_1': 'fa', 'name': 'فارسی'}]
45456                    [{'iso_639_1': 'tl', 'name': ''}]
45457             [{'iso_639_1': 'en', 'name': 'English'}]
45458                                                   []
45459             [{'iso_639_1': 'en', 'name': 'English'}]
Name: spoken_languages, Length: 45460, dtype: object

In [ ]:
dimenciones = df_s_l.shape
lista_de_=[]

#Creo una lista con los valores de cada registro
for i in range(dimenciones[0]-1):
    s = str(df_s_l.loc[i])
    lista_de_.append(eval(s))

In [51]:
for_df = []
#Hago la devida transformación a dataframe
for lista in lista_de_:
    for dicc in lista:
        for_df.append(dicc)

df_s_l = pd.DataFrame(for_df)

In [52]:
df_s_l.columns=['spooken_language','full_language']

In [53]:
df_s_l

      spooken_language full_language
0                   en       English
1                   en       English
2                   fr      Français
3                   en       English
4                   en       English
...                ...           ...
53294               en       English
53295               en       English
53296               fa         فارسی
53297               tl
53298               en       English

[53299 rows x 2 columns]

In [54]:
df_a_transformar.head(2)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0

In [ ]:
dimenciones = df_a_transformar.shape
mask=df_a_transformar.isnull()
lista_val=[]
for i in range(dimenciones[0]-1):
    if mask['belongs_to_collection'].loc[i] == False:
        lista_val.append(i)

lista_val

In [56]:
df_a_transformar=df_a_transformar.reset_index()

In [59]:
#2371, 3313, 3812
lista_val.pop(2371)
lista_val.pop(3313)
lista_val.pop(3812)

35755

In [60]:
df_btc['index'] = lista_val

In [61]:
df_a_transformar = df_a_transformar.reset_index()

In [62]:
df_prueba=pd.merge(df_a_transformar,df_btc, on='index', how='left')

In [64]:
df_btc

,id,name,poster_path,backdrop_path,index
0,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg,0
1,119050,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg,2
2,96871,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg,4
3,645,James Bond Collection,/HORpg5CSkmeQlAolx3bKMrKgfi.jpg,/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg,9
4,117693,Balto Collection,/w0ZgH6Lgxt2bQYnf1ss74UvYftm.jpg,/9VM5LiJV0bGb1st1KyHA3cVnO2G.jpg,12
...,...,...,...,...,...
4483,37261,The Carry On Collection,/2P0HNrYgKDvirV8RCdT1rBSJdbJ.jpg,/38tF1LJN7ULeZAuAfP7beaPMfcl.jpg,45355
4484,37261,The Carry On Collection,/2P0HNrYgKDvirV8RCdT1rBSJdbJ.jpg,/38tF1LJN7ULeZAuAfP7beaPMfcl.jpg,45358
4485,37261,The Carry On Collection,/2P0HNrYgKDvirV8RCdT1rBSJdbJ.jpg,/38tF1LJN7ULeZAuAfP7beaPMfcl.jpg,45369
4486,477208,DC Super Hero Girls Collection,None,None,45371
4487,200641,Red Lotus Collection,/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg,/3fhHbLeO3DqdHvgHg5szs399eBb.jpg,45382

In [65]:
mask=df_prueba[['name', 'belongs_to_collection']]

,name,belongs_to_collection
0,Toy Story Collection,"{'id': 10194, 'name': 'Toy Story Collection', ..."
1,NaN,NaN
2,Grumpy Old Men Collection,"{'id': 119050, 'name': 'Grumpy Old Men Collect..."
3,NaN,NaN
4,Father of the Bride Collection,"{'id': 96871, 'name': 'Father of the Bride Col..."
...,...,...
45461,NaN,NaN
45462,NaN,NaN
45463,NaN,NaN
45464,NaN,NaN
45465,NaN,NaN